---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireConduitType
source: html/3c17c9e5-7018-1cf6-4a20-d8059cec370c.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitType

Represents a specific conduit type of wire type.

## Syntax (C#)
```csharp
public class WireConduitType : APIObject
```